import numpy as np

# Exploring Fancy Index

# ex. arr[0], arr[:5], arr[arr>0]

rand = np.random.RandomState(42)
x = rand.randint(100, size=10)
# print(x)

# [51 92 14 71 60 20 82 86 74 74]

#------------------------------------------------------------------------------

# print([x[3],x[7],x[2]])

# [71, 86, 14]

#------------------------------------------------------------------------------

# ind = [3,7,4]
# print(x[ind])

# [71 86 60]

#------------------------------------------------------------------------------

# Indexing 결과 값에 대한 데이터 타입은 전달된 Index의 데이터 타입을 따른다.
# 사실 이것보단 reshape를 많이 쓰긴 함.
# 익숙하기만 하다면 reshape보다 간편하긴 함

# ind = np.array([[3,7],
#                 [4,5]])
# print(x[ind])

# [[71 86]
#  [60 20]]

#------------------------------------------------------------------------------

