# ------------------------------------------------------------------
# import Package
# 시간을 다루는 패키지
# ------------------------------------------------------------------
from datetime import datetime
from dateutil import parser
# ------------------------------------------------------------------
#
# 어떠한 시점의 시각을 나타내는 것 --> Time Stamp
# ------------------------------------------------------------------

# print(datetime(year=2025,month=4,day=10,hour=11,minute=17,second=00))

# ------------------------------------------------------------------

# date=parser.parse("10th of April, 2025") # 문자열에서 날짜를 파싱해서 date에 저장
# (print(date)) # date 출력
# print(date.strftime('%A')) # 요일

# ------------------------------------------------------------------
# numpy로 넘어오니까 매우 큰 데이터를 처리하다보니 원래 datetime 함수가 매우 느리게 실행됨
# ------------------------------------------------------------------

import numpy as np
date = np.array('2025-04-10',dtype=np.datetime64)
print(date)

# ------------------------------------------------------------------