# -------------------------------------------------
# 패키지 import
# -------------------------------------------------
import pandas as pd
import numpy as np

# -------------------------------------------------
# pandas 버전 확인
# -------------------------------------------------
# print(pd.__version__)

# -------------------------------------------------
# pd.series는 pandas의 1차원 배열을 뜻함
# -------------------------------------------------
data = pd.Series([0.25,0.5,0.75,1.0])
print(data) # index와 value 값과 데이터 타입 출력
print(data.values) # 배열 value 출력
print(data.index) # index 범위 출력
